###############################################################
#  Generated by:      Cadence Innovus 19.17-s077_1
#  OS:                Linux x86_64(Host ID ieng6-641.ucsd.edu)
#  Generated on:      Tue Mar 15 16:09:10 2022
#  Design:            fullchip
#  Command:           saveDesign placement.enc
###############################################################
current_design fullchip
create_clock [get_ports {clk_core1}]  -name clk_core1 -period 1.000000 -waveform {0.000000 0.500000}
create_clock [get_ports {clk_core2}]  -name clk_core2 -period 1.000000 -waveform {0.000000 0.500000}
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[82]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[75]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[68]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[122]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[115]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[108]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[13]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[52]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[45]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[38]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[5]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[30]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[23]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[16]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[98]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[3]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[123]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[116]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[109]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[90]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[83]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[76]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[69]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[14]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[60]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[53]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[46]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[39]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[6]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[31]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[24]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[17]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[99]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[4]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[124]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[117]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[91]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[84]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[77]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[15]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[100]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[61]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[54]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[47]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[7]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[32]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[25]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[18]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[5]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[125]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[118]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[92]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[85]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[78]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[16]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[101]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[62]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[55]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[48]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[8]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[40]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[33]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[26]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[19]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[6]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[126]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[119]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[93]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[86]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[79]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[10]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[102]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[70]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[63]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[56]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[49]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[9]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[41]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[34]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[27]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[7]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[127]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[94]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[87]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[11]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[110]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[103]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[71]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[64]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[57]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[42]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[35]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[28]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[8]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {acc}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[95]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[88]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[12]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[111]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[104]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[72]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[65]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[58]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {fifo_ext_rd}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[50]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[43]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[36]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[29]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[9]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[96]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[89]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[20]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[13]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[112]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[105]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[80]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[73]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[66]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[59]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[51]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[44]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[37]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[97]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[21]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[14]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {wr_norm}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[2]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[120]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[113]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[106]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[81]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[74]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[67]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[52]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[45]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[38]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {reset}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[98]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[22]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[15]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[121]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[114]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[107]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[3]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[82]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[75]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[68]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {div}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[100]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[60]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[53]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[46]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[39]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[99]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[30]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[23]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[16]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[122]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[115]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[108]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[4]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[90]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[83]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[76]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[69]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[101]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[61]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[54]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[47]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[31]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[24]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[17]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[123]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[116]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[109]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[5]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[91]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[84]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[77]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[102]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[62]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[55]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[48]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[32]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[25]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[18]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[124]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[117]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[10]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[6]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[92]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[85]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[78]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[110]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[103]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[70]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[63]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[56]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[49]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[40]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[33]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[26]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[19]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[125]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[118]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[11]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[7]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[93]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[86]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[79]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[111]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[104]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[71]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[64]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[57]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[41]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[34]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[27]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[8]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[126]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[119]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[12]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[94]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[87]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[112]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[105]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[72]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[65]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[58]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[10]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[42]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[35]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[28]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[2]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[9]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[127]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[20]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[13]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[95]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[88]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[0]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[120]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[113]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[106]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[80]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[73]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[66]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[59]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[11]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[50]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[43]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[36]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[29]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[3]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[21]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[14]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[96]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[89]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[1]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[121]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[114]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[107]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[81]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[74]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[67]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[12]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[51]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[44]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[37]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {inst[4]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[22]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core1[15]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[97]}]
set_input_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {mem_in_core2[2]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[50]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[43]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[36]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[29]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[21]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[14]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[142]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[135]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[128]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[111]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[104]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[51]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[44]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[37]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[22]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[15]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[150]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[143]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[136]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[129]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[112]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[105]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[52]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[45]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[38]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[30]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[23]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[16]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[151]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[144]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[137]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[120]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[113]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[106]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[60]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[53]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[46]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[39]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[31]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[24]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[17]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[152]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[145]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[138]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[121]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[114]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[107]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[61]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[54]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[47]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[32]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[25]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[18]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[153]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[146]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[139]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[122]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[115]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[108]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[62]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[55]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[48]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[40]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[33]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[26]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[19]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[154]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[147]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[130]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[123]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[116]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[109]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[70]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[63]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[56]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[49]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[41]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[34]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[27]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[155]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[148]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[131]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[124]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[117]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[71]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[64]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[57]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[42]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[35]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[28]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[156]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[149]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[132]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[125]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[118]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[72]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[65]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[58]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[50]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[43]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[36]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[29]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[157]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[140]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[133]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[126]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[119]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[80]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[73]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[66]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[59]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[51]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[44]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[37]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[158]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[141]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[134]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[127]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[81]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[74]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[67]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[52]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[45]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[38]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[159]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[0]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[142]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[135]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[128]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[82]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[75]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[68]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[60]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[53]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[46]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[39]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[1]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[150]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[143]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[136]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[129]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[90]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[83]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[76]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[69]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[61]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[54]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[47]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[2]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[151]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[144]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[137]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[91]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[84]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[77]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[62]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[55]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[48]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[3]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[152]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[145]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[138]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[92]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[85]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[78]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[70]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[63]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[56]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[49]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[4]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[153]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[146]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[139]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[93]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[86]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[79]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[71]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[64]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[57]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[5]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[154]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[147]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[94]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[87]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[72]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[65]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[58]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[6]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[155]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[148]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[95]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[88]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[80]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[73]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[66]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[59]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[7]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[156]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[149]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[96]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[89]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[81]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[74]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[67]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[8]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[157]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[97]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[82]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[75]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[68]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[9]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[0]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[158]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[98]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[90]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[83]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[76]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[69]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[1]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[159]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[99]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[91]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[84]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[77]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[2]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[100]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[92]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[85]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[78]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[3]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[101]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[93]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[86]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[79]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[10]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[4]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[102]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[94]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[87]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[11]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[5]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[110]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[103]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[95]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[88]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[12]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[6]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[111]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[104]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[96]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[89]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[20]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[13]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[7]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[112]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[105]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[97]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[21]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[14]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[8]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[120]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[113]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[106]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[98]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[22]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[15]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[9]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[121]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[114]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[107]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[99]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[30]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[23]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[16]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[122]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[115]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[108]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[31]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[24]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[17]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[130]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[123]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[116]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[109]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[32]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[25]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[18]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[10]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[131]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[124]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[117]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[100]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[40]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[33]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[26]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[19]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[11]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[132]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[125]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[118]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[101]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[41]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[34]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[27]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[12]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[140]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[133]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[126]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[119]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[102]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[42]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[35]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[28]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[20]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[13]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[141]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[134]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core1[127]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[110]}]
set_output_delay -add_delay 0.2 -clock [get_clocks {clk_core1}] [get_ports {out_core2[103]}]
